@echo off
 
echo  #     #          #######             ######                                     
echo  #  #  # # #    # #       # #    #    #     # #   #                              
echo  #  #  # # ##   # #       #  #  #     #     #  # #                               
 echo #  #  # # # #  # #####   #   ##      ######    #                                
echo  #  #  # # #  # # #       #   ##      #     #   #                                
echo  #  #  # # #   ## #       #  #  #     #     #   #                                
echo   ## ##  # #    # #       # #    #    ######    #                                
echo .                                                                                 
echo  #     #                                    #     #                      ####### 
echo  ##   ##   ##   #####   ####  ###### #      #     #   ##   #####    ##   #       
echo  # # # #  #  #  #    # #      #      #      #     #  #  #  #    #  #  #  #       
echo  #  #  # #    # #    #  ####  #####  #      ####### #    # #    # #    # ######  
echo  #     # ###### #####       # #      #      #     # ###### #####  ######       # 
echo  #     # #    # #   #  #    # #      #      #     # #    # #      #    # #     # 
echo  #     # #    # #    #  ####  ###### ###### #     # #    # #      #    #  #####                                                                                           
ver
::Выводит версии шиндовса
DISM /Online /Cleanup-Image /CheckHealth
::Проверяет целостность файлов через DISM
sfc /scannow
::Проверяет целостность файлов через sfc
pause
::Останавливает код после исполнения чтобы пользователь глянул что и как